Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСпособовОтраженияЗарплатыВБухУчете</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьВходящиеДанныеЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ТипыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управленческий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вспомогательный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/ChartsOfAccounts/ЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ЕПСБУ</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДетализацииКОСГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКазенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляБюджетных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтономных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНеУказыватьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКЭК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНеУчитываемых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете/Forms/ФормаЗаписиГруппа/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоКопирование = Параметры.Свойство("Копирование");
	ЭтоНовый = Параметры.Свойство("Новый");
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Для Каждого СвойствоСтруктуры Из Параметры.ЗначенияЗаполнения Цикл
			Если Элементы.Найти(СвойствоСтруктуры.Ключ) <> Неопределено Тогда
				ЭтотОбъект[СвойствоСтруктуры.Ключ] = СвойствоСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;

	УстановитьСвойстваСчета(ЭтотОбъект);
	УстановитьСвойстваСчетаНУ(ЭтотОбъект);

	Если Не ЭтоНовый Тогда
		ЗаполнитьКоллекцияВидыОпераций(Не ЭтоКопирование);
	КонецЕсли;
	
	ПоказатьТолькоВыбранныеОперации = КоллекцияВидыОпераций.Количество() <> 0;
	
	ОбновитьТаблицуВидыОпераций(ПоказатьТолькоВыбранныеОперации);
	Элементы.ВидыОперацийПоказатьТолькоВыбранныеОперации.Пометка = ПоказатьТолькоВыбранныеОперации;
	
	УстановитьФункциональныеОпцииФормы();
	УстановитьВидимостьЭлементовНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтаФорма);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("РегистрСведений_НастройкаСпособовОтраженияЗарплатыВБухУчете_ДобавленаИзмененаЗапись");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	
	УстановитьСвойстваСчета(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура СчетДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораСчета = ПолучитьПараметрыВыбораСчетДтНаСервере(КоллекцияВидыОпераций.ВыгрузитьЗначения());

	ПараметрыВыбораСчета.Вставить("КодТекущейСтроки", СчетДт);
	ПараметрыВыбораСчета.Вставить("ТипСчета", ПредопределенноеЗначение("Перечисление.ТипыСчетов.Бухгалтерский"));
	ПараметрыВыбораСчета.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыВыбораСчета, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура Субконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНУПриИзменении(Элемент)
	
	УстановитьСвойстваСчетаНУ(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораСчета = Новый Структура;
	
	ПараметрыВыбораСчета.Вставить("ТипСчета", ПредопределенноеЗначение("Перечисление.ТипыСчетов.Налоговый"));
	ПараметрыВыбораСчета.Вставить("Забалансовый", Истина);
	ПараметрыВыбораСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыВыбораСчета, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СубконтоНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 1, "НУ");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 2, "НУ");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 3, "НУ");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыВидыОпераций

&НаКлиенте
Процедура ВидыОперацийПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ВидыОперацийПометка" Тогда
		
		ТекСтрока = Элемент.ТекущиеДанные;
		
		Если ТекСтрока.Включить = 2 Тогда
			ТекСтрока.Включить = 0;
		КонецЕсли;
		
		УстановитьПометкиПодчиненных(ТекСтрока);
		УстановитьПометкиРодителей(ТекСтрока);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьТолькоВыбранныеОперации(Команда)
	ПоказатьТолькоВыбранныеОперации = НЕ Элементы.ВидыОперацийПоказатьТолькоВыбранныеОперации.Пометка; 
	Элементы.ВидыОперацийПоказатьТолькоВыбранныеОперации.Пометка = ПоказатьТолькоВыбранныеОперации;
	
	ОбновитьТаблицуВидыОпераций(ПоказатьТолькоВыбранныеОперации);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОперации(Команда)
	
	Для Каждого Строка Из ВидыОпераций.ПолучитьЭлементы() Цикл
		Строка.Включить = 1;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьОперации(Команда)
	
	Для Каждого Строка Из ВидыОпераций.ПолучитьЭлементы() Цикл
		Строка.Включить = 0;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьЗавершение();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииОрганизацииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	УстановитьВидимостьЭлементовНаСервере();
	
	Если НЕ ПлательщикНалогаНаПрибыль И ЗначениеЗаполнено(СчетНУ) Тогда
		
		СчетНУ = ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка");
		СубконтоНУ1 = Неопределено;
		СубконтоНУ2 = Неопределено;
		СубконтоНУ3 = Неопределено;
		
	КонецЕсли;	
	
	Если НЕ ПрименяетсяУСНДоходыМинусРасходы И ЗначениеЗаполнено(ОтражениеВУСН) Тогда
		
		 ОтражениеВУСН  = ПредопределенноеЗначение("Перечисление.ОтражениеВУСН.ПустаяСсылка");
		 
	КонецЕсли;	 
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьЭлементовНаСервере()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Элементы.ГруппаОтражениеВНУ.Видимость  = ПлательщикНалогаНаПрибыль;
		Элементы.ГруппаОтражениеВУСН.Видимость = ПрименяетсяУСНДоходыМинусРасходы;
	Иначе
		Элементы.ГруппаОтражениеВНУ.Видимость  = Истина;
		Элементы.ГруппаОтражениеВУСН.Видимость = Истина;
	КонецЕсли;
	
	Элементы.КодНалоговогоОргана.Видимость = ЭтоОперацииНДФЛ;
	
	МассивСпособыОтраженияЗарплаты = Новый Массив;
	МассивСпособыОтраженияЗарплаты.Добавить(Справочники.СпособыОтраженияЗарплатыВБухУчете.ВедомостьНаВыплатуЗарплатыВБанк);
	МассивСпособыОтраженияЗарплаты.Добавить(Справочники.СпособыОтраженияЗарплатыВБухУчете.ВедомостьПрочихДоходовВБанк);
	
	Элементы.НастройкиБУиНУ.Видимость = МассивСпособыОтраженияЗарплаты.Найти(СпособОтраженияЗарплатыВБухУчете) = Неопределено;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()

	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрОрганизацияФункциональныхОпцийФормы(ЭтаФорма, Организация, Период);
	
	ПлательщикНалогаНаПрибыль = НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(Организация, Период);
	
	ПрименяетсяУСНДоходыМинусРасходы = УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Организация, Период);
	
	ЭтоОперацииНДФЛ = Ложь;
	Если СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.НДФЛ Тогда
		ЭтоОперацииНДФЛ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСчета(Форма)

	МассивПолей = Новый Массив;
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто1", "Субконто1", "Субконто1", Истина, "Субконто1", Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто2", "Субконто2", "Субконто2", Истина, "Субконто2", Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто3", "Субконто3", "Субконто3", Истина, "Субконто3", Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Форма.СчетДт, Форма, Форма, МассивПолей);
	
	Для Индекс = 1 По 3 Цикл
		СубконтоДоступно = Форма.Элементы["Субконто"+Индекс].Доступность;
		Если НЕ СубконтоДоступно Тогда
			Форма["Субконто"+Индекс] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСчетаНУ(Форма)

	МассивПолей = Новый Массив;
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто1", "СубконтоНУ1", "СубконтоНУ1", Истина, "СубконтоНУ1", Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто2", "СубконтоНУ2", "СубконтоНУ2", Истина, "СубконтоНУ2", Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто3", "СубконтоНУ3", "СубконтоНУ3", Истина, "СубконтоНУ3", Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Форма.СчетНУ, Форма, Форма, МассивПолей);
	
	Для Индекс = 1 По 3 Цикл
		СубконтоДоступно = Форма.Элементы["СубконтоНУ"+Индекс].Доступность;
		Если НЕ СубконтоДоступно Тогда
			Форма["СубконтоНУ"+Индекс] = Неопределено;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыбораСчетДтНаСервере(МассивВидыОпераций)

	ПараметрыВыбораСчета = РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.ПолучитьПараметрыВыбораСчетНаСервере(МассивВидыОпераций);
	
	Возврат ПараметрыВыбораСчета;

КонецФункции

&НаСервере
Процедура ЗаполнитьКоллекцияВидыОпераций(ЗагрузитьЭталон = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",								Период);
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("КодНалоговогоОргана",				КодНалоговогоОргана);
	Запрос.УстановитьПараметр("СпособОтраженияЗарплатыВБухУчете",	СпособОтраженияЗарплатыВБухУчете);
	Запрос.УстановитьПараметр("СчетДт",								СчетДт);
	Запрос.УстановитьПараметр("Субконто1",							Субконто1);
	Запрос.УстановитьПараметр("Субконто2",							Субконто2);
	Запрос.УстановитьПараметр("Субконто3",							Субконто3);
	Запрос.УстановитьПараметр("СчетНУ",								СчетНУ);
	Запрос.УстановитьПараметр("СубконтоНУ1",						СубконтоНУ1);
	Запрос.УстановитьПараметр("СубконтоНУ2",						СубконтоНУ2);
	Запрос.УстановитьПараметр("СубконтоНУ3",						СубконтоНУ3);
	Запрос.УстановитьПараметр("ОтражениеВУСН",						ОтражениеВУСН);
	Запрос.УстановитьПараметр("НеИспользоватьВходящиеДанныеЗГУ",	НеИспользоватьВходящиеДанныеЗГУ);
	Запрос.УстановитьПараметр("КодЦели",							КодЦели);
	Запрос.УстановитьПараметр("КодМероприятия",						КодМероприятия);
	Запрос.УстановитьПараметр("ДопКлассификация",					ДопКлассификация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.ВидОперации КАК ВидОперации,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.Период КАК Период,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.Организация КАК Организация,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.КодНалоговогоОргана КАК КодНалоговогоОргана,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете КАК СпособОтраженияЗарплатыВБухУчете
	               |ИЗ
	               |	РегистрСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете КАК НастройкаСпособовОтраженияЗарплатыВБухУчете
	               |ГДЕ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчете.Период = &Период
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СпособОтраженияЗарплатыВБухУчете = &СпособОтраженияЗарплатыВБухУчете
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Организация = &Организация
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.КодНалоговогоОргана = &КодНалоговогоОргана
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СчетДт = &СчетДт
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Субконто1 = &Субконто1
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Субконто2 = &Субконто2
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.Субконто3 = &Субконто3
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СчетНУ = &СчетНУ
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СубконтоНУ1 = &СубконтоНУ1
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СубконтоНУ2 = &СубконтоНУ2
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.СубконтоНУ3 = &СубконтоНУ3
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.ОтражениеВУСН = &ОтражениеВУСН
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.НеИспользоватьВходящиеДанныеЗГУ = &НеИспользоватьВходящиеДанныеЗГУ
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.КодЦели = &КодЦели
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.КодМероприятия = &КодМероприятия
	               |	И НастройкаСпособовОтраженияЗарплатыВБухУчете.ДопКлассификация = &ДопКлассификация";
	
	ТЗВидыОпераций = Запрос.Выполнить().Выгрузить();
	
	Если ЗагрузитьЭталон Тогда
		КоллекцияВидыОперацийЭталон.Загрузить(ТЗВидыОпераций);
	КонецЕсли;

	КоллекцияВидыОпераций.ЗагрузитьЗначения(ТЗВидыОпераций.ВыгрузитьКолонку("ВидОперации"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуВидыОпераций(ПоказатьТолькоВыбранныеОперации = Истина)
	
	Если ЭтотОбъект.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.ВедомостьНаВыплатуЗарплатыВБанк
		ИЛИ ЭтотОбъект.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.ВедомостьПрочихДоходовВБанк Тогда
		ОперацииВедомостьВБанк			= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("ВедомостьВБанк");
	ИначеЕсли ЭтотОбъект.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.НДФЛ Тогда
		ОперацииНДФЛ					= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("НДФЛ");
	Иначе
		ОперацииНачисления				= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("Начисления");
		ОперацииЕжегодныеОтпуска		= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("НачисленияОценочныеОбязательстваИРезервы");
		ОперацииЕжегодныеОтпускаВзносы	= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("ВзносыОценочныеОбязательстваИРезервы");
		ОперацииНачислениеРезервов		= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("НачислениеРезервов");
		ОперацииВзносы					= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("Взносы");
		ОперацииУдержания				= Перечисления.ВидыОперацийПоЗарплате.ВидыОперацийПоГруппам("Удержания");
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВидыОперацийПоЗарплате.Ссылка КАК ВидОперации,
	               |	ВЫБОР
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииНачисления)
	               |			ТОГДА &ТекстНачисления
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииВзносы)
	               |			ТОГДА &ТекстВзносы
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииУдержания)
	               |			ТОГДА &ТекстУдержания
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииНДФЛ)
	               |			ТОГДА &ТекстНДФЛ
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииЕжегодныеОтпуска)
	               |			ТОГДА &ТекстЕжегодныеОтпуска
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииЕжегодныеОтпускаВзносы)
	               |			ТОГДА &ТекстЕжегодныеОтпускаВзносы
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииНачислениеРезервов)
	               |			ТОГДА &ТекстНачислениеРезервов
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&ОперацииВедомостьВБанк)
	               |			ТОГДА &ТекстВедомостьВБанк
	               |	КОНЕЦ КАК Группа,
	               |	ВЫБОР
	               |		КОГДА ВидыОперацийПоЗарплате.Ссылка В (&КоллекцияВидыОпераций)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Включить,
	               |	ВидыОперацийПоЗарплате.Порядок КАК Порядок
	               |ИЗ
	               |	Перечисление.ВидыОперацийПоЗарплате КАК ВидыОперацийПоЗарплате
	               |ГДЕ
	               |	ВидыОперацийПоЗарплате.Ссылка В (&ОперацииНачисления,
	               |		&ОперацииВзносы,
	               |		&ОперацииУдержания,
	               |		&ОперацииНДФЛ,
	               |		&ОперацииЕжегодныеОтпуска,
	               |		&ОперацииЕжегодныеОтпускаВзносы,
	               |		&ОперацииНачислениеРезервов,
	               |		&ОперацииВедомостьВБанк)
	               |	[ОтборПоПричине]
	               |
	               |ИТОГИ
	               |	Группа КАК ВидОперации,
	               |	МАКСИМУМ(Включить)
	               |ПО
	               |	Группа";
	
	Если ПоказатьТолькоВыбранныеОперации Тогда
		СтрокаОтбора = "И ВидыОперацийПоЗарплате.Ссылка В(&КоллекцияВидыОпераций)";
	Иначе
		СтрокаОтбора = "";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ОтборПоПричине]", СтрокаОтбора);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОперацииНачисления", 			ОперацииНачисления);
	Запрос.УстановитьПараметр("ОперацииЕжегодныеОтпуска",		ОперацииЕжегодныеОтпуска);
	Запрос.УстановитьПараметр("ОперацииВзносы",					ОперацииВзносы);
	Запрос.УстановитьПараметр("ОперацииУдержания",				ОперацииУдержания);
	Запрос.УстановитьПараметр("ОперацииНДФЛ",					ОперацииНДФЛ);
	Запрос.УстановитьПараметр("ОперацииЕжегодныеОтпускаВзносы",	ОперацииЕжегодныеОтпускаВзносы);
	Запрос.УстановитьПараметр("ОперацииНачислениеРезервов",		ОперацииНачислениеРезервов);
	Запрос.УстановитьПараметр("КоллекцияВидыОпераций",			КоллекцияВидыОпераций.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ОперацииВедомостьВБанк",			ОперацииВедомостьВБанк);
	Запрос.УстановитьПараметр("ТекстНачисления",				НСтр("ru='Начисления'")); 
	Запрос.УстановитьПараметр("ТекстЕжегодныеОтпуска",			НСтр("ru='Начисления за счет оценочных обязательств и резервов'")); 
	Запрос.УстановитьПараметр("ТекстВзносы",					НСтр("ru='Взносы'"));
	Запрос.УстановитьПараметр("ТекстУдержания",					НСтр("ru='Удержания'"));
	Запрос.УстановитьПараметр("ТекстНДФЛ",						НСтр("ru='НДФЛ'"));
	Запрос.УстановитьПараметр("ТекстЕжегодныеОтпускаВзносы",	НСтр("ru='Взносы за счет оценочных обязательств и резервов'"));
	Запрос.УстановитьПараметр("ТекстНачислениеРезервов",		НСтр("ru='Начисление резервов по отпускам'"));
	Запрос.УстановитьПараметр("ТекстВедомостьВБанк",			НСтр("ru='Ведомость в банк'"));
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(Выборка,"ВидыОпераций");
	
КонецПроцедуры

&НаСервере
Процедура ВидыОперацийПометкаПриИзмененииНаСервере(ВидОперации, ДобавитьВидОперации)
	
	НайденныйВидОперации = КоллекцияВидыОпераций.НайтиПоЗначению(ВидОперации);
	
	Если ДобавитьВидОперации Тогда
		Если НайденныйВидОперации = Неопределено Тогда
			КоллекцияВидыОпераций.Добавить(ВидОперации);
		КонецЕсли;
	Иначе
		Если НайденныйВидОперации <> Неопределено Тогда
			КоллекцияВидыОпераций.Удалить(НайденныйВидОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекСтрока)
	
	Если ЗначениеЗаполнено(ТекСтрока.ВидОперации) Тогда
		ВидыОперацийПометкаПриИзмененииНаСервере(ТекСтрока.ВидОперации, ТекСтрока.Включить);
	КонецЕсли;
		
	Подчиненные = ТекСтрока.ПолучитьЭлементы();
	
	Если Подчиненные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Подчиненные Цикл
		Строка.Включить = ТекСтрока.Включить;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекСтрока)
	
	Родитель = ТекСтрока.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекСостояние = Родитель.Включить;
	
	НайденыВключенные  = Ложь;
	НайденыВыключенные = Ложь;
	
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		Если Строка.Включить = 0 Тогда
			НайденыВыключенные = Истина;
		ИначеЕсли Строка.Включить = 1
			ИЛИ Строка.Включить = 2 Тогда
			НайденыВключенные  = Истина;
		КонецЕсли; 
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если НайденыВключенные И НайденыВыключенные Тогда
		Включить = 2;
	ИначеЕсли НайденыВключенные И (Не НайденыВыключенные) Тогда
		Включить = 1;
	ИначеЕсли (Не НайденыВключенные) И НайденыВыключенные Тогда
		Включить = 0;
	ИначеЕсли (Не НайденыВключенные) И (Не НайденыВыключенные) Тогда
		Включить = 2;
	КонецЕсли;
	
	Если Включить = ТекСостояние Тогда
		Возврат;
	Иначе
		Родитель.Включить = Включить;
		УстановитьПометкиРодителей(Родитель);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Отказ = ПроверитьЗаполнениеФормы();
	
	Если Не Отказ Тогда
		ЗаписатьДвижения();
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвижения()
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого СтрокаТаблицы Из КоллекцияВидыОперацийЭталон Цикл
			НаборЗаписейЭталон = РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СоздатьНаборЗаписей();
			НаборЗаписейЭталон.Отбор.Период.Установить(СтрокаТаблицы.Период);
			НаборЗаписейЭталон.Отбор.СпособОтраженияЗарплатыВБухУчете.Установить(СтрокаТаблицы.СпособОтраженияЗарплатыВБухУчете);
			НаборЗаписейЭталон.Отбор.Организация.Установить(СтрокаТаблицы.Организация);
			НаборЗаписейЭталон.Отбор.КодНалоговогоОргана.Установить(СтрокаТаблицы.КодНалоговогоОргана);
			НаборЗаписейЭталон.Отбор.ВидОперации.Установить(СтрокаТаблицы.ВидОперации);
			НаборЗаписейЭталон.Очистить();
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейЭталон);
		КонецЦикла;
		
		НовыйНаборЗаписей = РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.Период.Установить(НачалоМесяца(ЭтотОбъект.Период));
		НовыйНаборЗаписей.Отбор.СпособОтраженияЗарплатыВБухУчете.Установить(ЭтотОбъект.СпособОтраженияЗарплатыВБухУчете);
		НовыйНаборЗаписей.Отбор.Организация.Установить(ЭтотОбъект.Организация);
		НовыйНаборЗаписей.Отбор.КодНалоговогоОргана.Установить(ЭтотОбъект.КодНалоговогоОргана);
		НовыйНаборЗаписей.Прочитать();
		
		Для Каждого СтрокаТаблицы Из КоллекцияВидыОпераций Цикл
			НоваяЗапись = НовыйНаборЗаписей.Добавить();
			НоваяЗапись.Период								= НачалоМесяца(ЭтотОбъект.Период);
			НоваяЗапись.Организация							= ЭтотОбъект.Организация;
			НоваяЗапись.КодНалоговогоОргана					= ЭтотОбъект.КодНалоговогоОргана;
			НоваяЗапись.СпособОтраженияЗарплатыВБухУчете	= ЭтотОбъект.СпособОтраженияЗарплатыВБухУчете;
			НоваяЗапись.ВидОперации 						= СтрокаТаблицы.Значение;
			НоваяЗапись.СчетДт								= ЭтотОбъект.СчетДт;
			НоваяЗапись.Субконто1							= ЭтотОбъект.Субконто1;
			НоваяЗапись.Субконто2							= ЭтотОбъект.Субконто2;
			НоваяЗапись.Субконто3							= ЭтотОбъект.Субконто3;
			НоваяЗапись.СчетНУ								= ЭтотОбъект.СчетНУ;
			НоваяЗапись.СубконтоНУ1 						= ЭтотОбъект.СубконтоНУ1;
			НоваяЗапись.СубконтоНУ2 						= ЭтотОбъект.СубконтоНУ2;
			НоваяЗапись.СубконтоНУ3 						= ЭтотОбъект.СубконтоНУ3;
			НоваяЗапись.ОтражениеВУСН						= ЭтотОбъект.ОтражениеВУСН;
			НоваяЗапись.НеИспользоватьВходящиеДанныеЗГУ		= ЭтотОбъект.НеИспользоватьВходящиеДанныеЗГУ;
			НоваяЗапись.КодЦели								= ЭтотОбъект.КодЦели;
			НоваяЗапись.КодМероприятия						= ЭтотОбъект.КодМероприятия;
			НоваяЗапись.ДопКлассификация					= ЭтотОбъект.ДопКлассификация;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйНаборЗаписей, Истина, Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеФормы()
	
	ПроверяемыеРеквизиты = Новый Структура;	
		
	ПроверяемыеРеквизиты.Вставить("СпособОтраженияЗарплатыВБухУчете",	НСтр("ru = 'Способ отражения'"));
	ПроверяемыеРеквизиты.Вставить("Организация",						НСтр("ru = 'Организация'"));
	ПроверяемыеРеквизиты.Вставить("Период",								НСтр("ru = 'Настройка действует с'"));
	ПроверяемыеРеквизиты.Вставить("ВидыОпераций",						НСтр("ru = 'Виды операций'"));

	Ошибки = Неопределено;
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		Если ПроверяемыйРеквизит.Ключ = "ВидыОпераций" Тогда
			Если КоллекцияВидыОпераций.Количество() = 0 Тогда
				ТекстОшибкиТЧ = НСтр("ru = 'Не выбран ""Вид операции""'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
					Ошибки,
					ПроверяемыйРеквизит.Ключ,
					ТекстОшибкиТЧ,);	
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ЭтаФорма[ПроверяемыйРеквизит.Ключ]) Тогда
				ТекстОшибки = НСтр("ru = 'Не заполнено обязательное поле ""%1""'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
					Ошибки,
					ПроверяемыйРеквизит.Ключ,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ПроверяемыйРеквизит.Значение),);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Счет
	Если ЗначениеЗаполнено(СчетДт) Тогда
		// Субконто
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетДт);
		Для Инд = 1 По СвойстваСчета.КоличествоСубконто Цикл
			Если СвойстваСчета["ВидСубконто" + Инд + "Обязательный"]
			   И Не ЗначениеЗаполнено(ЭтаФорма["Субконто" + Инд]) Тогда
				ТекстОшибкиТЧ = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
					СвойстваСчета["ВидСубконто" + Инд + "Наименование"]);
					
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
					Ошибки,
					"Субконто" + Инд,
					ТекстОшибкиТЧ,);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Счет НУ
	Если ЗначениеЗаполнено(СчетНУ) Тогда
		// Субконто НУ.
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетНУ);
		Для Инд = 1 По СвойстваСчета.КоличествоСубконто Цикл
			Если СвойстваСчета["ВидСубконто" + Инд + "Обязательный"]
			   И Не ЗначениеЗаполнено(ЭтаФорма["СубконтоНУ" + Инд]) Тогда
				ТекстОшибкиТЧ = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
					СвойстваСчета["ВидСубконто" + Инд + "Наименование"]);
					
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
					Ошибки,
					"СубконтоНУ" + Инд,
					ТекстОшибкиТЧ,);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Отказ = Ложь;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Возврат Отказ;

КонецФункции

&НаКлиенте
Процедура ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, ТекНомерСубконто, ПрефиксСчета = "Дт")

	ТекСчет = ?(ПрефиксСчета = "Дт", СчетДт, СчетНУ);
	
	Если НЕ ЗначениеЗаполнено(ТекСчет) Тогда
		ТекстПредупреждения = НСтр("ru='Не выбран счет затрат'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		СтандартнаяОбработка = Ложь;
		Возврат;
	Иначе
		СвойстваСчета = ПолучитьСвойстваСчета(ТекСчет);
		
		Если ТипЗнч(СвойстваСчета["ВидСубконто"+ТекНомерСубконто]) = Тип("Неопределено") Тогда
			ТекстПредупреждения = НСтр("ru='Для счета %1 субконто %2 не определено'");
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(	ТекстПредупреждения,
																							ТекСчет,
																							ТекНомерСубконто);
			ПоказатьПредупреждение(, ТекстПредупреждения);																						
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕслИ;
	
	СтрокаДанных = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
									ТекСчет,
									?(ПрефиксСчета = "Дт", Субконто1, СубконтоНУ1),
									?(ПрефиксСчета = "Дт", Субконто2, СубконтоНУ2),
									?(ПрефиксСчета = "Дт", Субконто3, СубконтоНУ3));
	
	
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбораСпр(Элемент, ДанныеВыбора, СтандартнаяОбработка, Организация,
													СтрокаДанных, ТекНомерСубконто);
	
КонецПроцедуры // ОбработатьВыборСубконто()

&НаСервереБезКонтекста
Функция ПолучитьСвойстваСчета(Счет)
	Возврат БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет);
КонецФункции

#КонецОбласти
